# St7GetBrickDrawAxes

Returns whether local brick axes are displayed with bricks.

long St7GetBrickDrawAxes(long uID, bool* Show1, bool* Show2, bool* Show3)

Input Parameters

uID

Strand7 model file ID.

Output Parameters

Show1

The state of the Draw x Axis option; either True or False.

Show2

The state of the Draw y Axis option; either True or False.

Show3

The state of the Draw z Axis option; either True or False.